#### BuiltInFailures.WallJoinFailures Members

---

|  |
| --- |
| BuiltInFailures WallJoinFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures WallJoinFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | FailedToChangeWallJointsTypeFailure | Some of the joints you have selected can only have one wall joint type, so these joints haven't been changed. |

# See Also

BuiltInFailures WallJoinFailures Class

Autodesk.Revit.DB Namespace